[NoCoverage] EqualityOperator
personal-website/pages/api/preview.tsx:11:5
   // Check the secret and next parameters
   // This secret should only be known to this API route and the CMS
   if (
-    req.query.secret !== process.env.GRAPHCMS_PREVIEW_SECRET ||
+    req.query.secret === process.env.GRAPHCMS_PREVIEW_SECRET ||
     !req.query.slug
   ) {

[NoCoverage] LogicalOperator
personal-website/pages/api/preview.tsx:11:5
   // Check the secret and next parameters
   // This secret should only be known to this API route and the CMS
   if (
-    req.query.secret !== process.env.GRAPHCMS_PREVIEW_SECRET ||
-    !req.query.slug
+    req.query.secret !== process.env.GRAPHCMS_PREVIEW_SECRET && !req.query.slug
   ) {
     return res.status(401).json({ message: "Invalid token" });

[NoCoverage] BooleanLiteral
personal-website/pages/api/preview.tsx:12:5
   // This secret should only be known to this API route and the CMS
   if (
     req.query.secret !== process.env.GRAPHCMS_PREVIEW_SECRET ||
-    !req.query.slug
+    req.query.slug
   ) {
     return res.status(401).json({ message: "Invalid token" });

[NoCoverage] BlockStatement
personal-website/pages/api/preview.tsx:13:5
   if (
     req.query.secret !== process.env.GRAPHCMS_PREVIEW_SECRET ||
     !req.query.slug
-  ) {
-    return res.status(401).json({ message: "Invalid token" });
-  }
+  ) {}
 
   // Fetch the headless CMS to check if the provided `slug` exists

[NoCoverage] ConditionalExpression
personal-website/pages/api/preview.tsx:21:7
   const post = await getPreviewPostBySlug(req.query.slug as string);
 
   // If the slug doesn't exist prevent preview mode from being enabled
-  if (!post) {
+  if (true) {
     return res.status(401).json({ message: "Invalid slug" });
   }

[NoCoverage] BlockStatement
personal-website/pages/api/preview.tsx:21:14
   const post = await getPreviewPostBySlug(req.query.slug as string);
 
   // If the slug doesn't exist prevent preview mode from being enabled
-  if (!post) {
-    return res.status(401).json({ message: "Invalid slug" });
-  }
+  if (!post) {}
 
   // Enable Preview Mode by setting the cookies

[NoCoverage] ObjectLiteral
personal-website/pages/api/preview.tsx:22:33
 
   // If the slug doesn't exist prevent preview mode from being enabled
   if (!post) {
-    return res.status(401).json({ message: "Invalid slug" });
+    return res.status(401).json({});
   }
 

[NoCoverage] StringLiteral
personal-website/pages/api/preview.tsx:30:34
 
   // Redirect to the path from the fetched post
   // We don't redirect to req.query.slug as that might lead to open redirect vulnerabilities
-  res.writeHead(307, { Location: `/posts/${post.slug}` });
+  res.writeHead(307, { Location: `` });
   res.end();
 }
