[NoCoverage] BooleanLiteral
Projects/personal-website/components/alert.tsx:10:40
     <div
       className={cn("border-b", {
         "bg-accent-7 border-accent-7 text-white": preview,
-        "bg-accent-1 border-accent-2": !preview,
+        "bg-accent-1 border-accent-2": preview,
       })}
     >
