[NoCoverage] BlockStatement
Projects/personal-website/components/container.tsx:7:17
   children,
 }: {
   children: JSX.Element | JSX.Element[];
-}): JSX.Element {
-  return <MuiContainer>{children}</MuiContainer>;
-}
+}): JSX.Element {}
 
