[NoCoverage] BlockStatement
Projects/personal-website/components/footer.tsx:3:47
 import Container from "./container";
 
-export default function Footer(): JSX.Element {
-  return (
-    <footer className="bg-accent-1 border-t border-accent-2">
-      <Container>
-        <div className="py-28 flex flex-col lg:flex-row items-center">
-          <h3 className="text-4xl lg:text-5xl font-bold tracking-tighter leading-tight text-center lg:text-left mb-10 lg:mb-0 lg:pr-4 lg:w-1/2">
-            Nigel Schuster&apos;s blog.
-          </h3>
-        </div>
-      </Container>
-    </footer>
-  );
-}
+export default function Footer(): JSX.Element {}
 
