[NoCoverage] OptionalChaining
Projects/personal-website/components/hero-post.tsx:50:39
 }: HeroPostFragment): JSX.Element {
   return (
     <Card>
-      <CardMedia component="img" src={coverImage?.url} />
+      <CardMedia component="img" src={coverImage.url} />
       <CardContent>
         <CardActionArea>

[NoCoverage] OptionalChaining
Projects/personal-website/components/hero-post.tsx:63:56
                   <Box alignSelf="flex-end">
                     <Chip
                       avatar={
-                        <Avatar alt={author.name} src={author.picture?.url} />
+                        <Avatar alt={author.name} src={author.picture.url} />
                       }
                       label={author.name ?? "Anonymous"}

[NoCoverage] LogicalOperator
Projects/personal-website/components/hero-post.tsx:65:30
                       avatar={
                         <Avatar alt={author.name} src={author.picture?.url} />
                       }
-                      label={author.name ?? "Anonymous"}
+                      label={author.name && "Anonymous"}
                     />
                   </Box>
