[NoCoverage] BlockStatement
Projects/personal-website/components/layout.tsx:11:17
 }: {
   preview: boolean;
   children: JSX.Element | JSX.Element[];
-}): JSX.Element {
-  return (
-    <>
-      <Meta />
-      <div className="min-h-screen">
-        <Alert preview={preview} />
-        <main>{children}</main>
-      </div>
-      <Footer />
-    </>
-  );
-}
+}): JSX.Element {}
 
