[NoCoverage] BlockStatement
Projects/personal-website/components/meta.tsx:8:19
 export default function Meta(): JSX.Element {
   const router = useRouter();
 
-  useEffect(() => {
-    const handleRouteChange = (url: string) => {
-      (
-        window as unknown as {
-          goatcounter: { count: ({ path }: { path: string }) => void };
-        }
-      ).goatcounter.count({
-        path: url,
-      });
-    };
-
-    router.events.on("routeChangeComplete", handleRouteChange);
-
-    return () => {
-      router.events.off("routeChangeStart", handleRouteChange);
-    };
-  }, [router.events]);
+  useEffect(() => {}, [router.events]);
   return (
     <Head>

[NoCoverage] BlockStatement
Projects/personal-website/components/meta.tsx:9:48
   const router = useRouter();
 
   useEffect(() => {
-    const handleRouteChange = (url: string) => {
-      (
-        window as unknown as {
-          goatcounter: { count: ({ path }: { path: string }) => void };
-        }
-      ).goatcounter.count({
-        path: url,
-      });
-    };
+    const handleRouteChange = (url: string) => {};
 
     router.events.on("routeChangeComplete", handleRouteChange);

[NoCoverage] BlockStatement
Projects/personal-website/components/meta.tsx:21:18
 
     router.events.on("routeChangeComplete", handleRouteChange);
 
-    return () => {
-      router.events.off("routeChangeStart", handleRouteChange);
-    };
+    return () => {};
   }, [router.events]);
   return (
