[NoCoverage] BlockStatement
Projects/personal-website/components/post-body.tsx:7:17
   content,
 }: {
   content: { html: string };
-}): JSX.Element {
-  return (
-    <div
-      className={`max-w-2xl mx-auto post ${postStyles.post}`}
-      dangerouslySetInnerHTML={{ __html: content?.html }}
-    />
-  );
-}
+}): JSX.Element {}
 

[NoCoverage] OptionalChaining
Projects/personal-website/components/post-body.tsx:11:42
   return (
     <div
       className={`max-w-2xl mx-auto post ${postStyles.post}`}
-      dangerouslySetInnerHTML={{ __html: content?.html }}
+      dangerouslySetInnerHTML={{ __html: content.html }}
     />
   );
