[NoCoverage] StringLiteral
Projects/personal-website/components/post-preview.tsx:16:41
 import gql from "graphql-tag";
 import Link from "next/link";
 
-export const POST_PREVIEW_FRAGMENT = gql`
-  fragment PostPreview on Post {
-    title
-    slug
-    excerpt
-    coverImage {
-      url(
-        transformation: {
-          image: { resize: { fit: crop, width: 2000, height: 1000 } }
-        }
-      )
-    }
-    author {
-      name
-      picture {
-        url(
-          transformation: {
-            image: { resize: { width: 100, height: 100, fit: crop } }
-          }
-        )
-      }
-    }
-  }
-`;
+export const POST_PREVIEW_FRAGMENT = gql``;
 
 export default function PostPreview({
