[NoCoverage] BlockStatement
Projects/personal-website/components/section-separator.tsx:1:57
-export default function SectionSeparator(): JSX.Element {
-  return <hr className="border-accent-2 mt-28 mb-24" />;
-}
+export default function SectionSeparator(): JSX.Element {}
 
