[NoCoverage] BlockStatement
Projects/personal-website/lib/createEmotionCache.ts:4:60
 import type { EmotionCache } from "@emotion/cache";
 import createCache from "@emotion/cache";
 
-export default function createEmotionCache(): EmotionCache {
-  return createCache({ key: "css" });
-}
+export default function createEmotionCache(): EmotionCache {}
 
