[NoCoverage] BlockStatement
Projects/personal-website/lib/graphcms.ts:19:30
 
 export async function getPreviewPostBySlug(
   slug: string,
-): Promise<{ slug: string }> {
-  const client = new ApolloClient({
-    uri: process.env.GRAPHCMS_PROJECT_API ?? "",
-    cache: new InMemoryCache(),
-  });
-  return client
-    .query({
-      query: GET_PREVIEW_POST_BY_SLUG,
-      variables: {
-        slug,
-        stage: "DRAFT",
-      },
-    })
-    .then((result) => {
-      return result.data;
-    });
-}
+): Promise<{ slug: string }> {}
 
 const ALL_POSTS_WITH_SLUG = gql`

[NoCoverage] ObjectLiteral
Projects/personal-website/lib/graphcms.ts:20:35
 export async function getPreviewPostBySlug(
   slug: string,
 ): Promise<{ slug: string }> {
-  const client = new ApolloClient({
-    uri: process.env.GRAPHCMS_PROJECT_API ?? "",
-    cache: new InMemoryCache(),
-  });
+  const client = new ApolloClient({});
   return client
     .query({

[NoCoverage] LogicalOperator
Projects/personal-website/lib/graphcms.ts:21:10
   slug: string,
 ): Promise<{ slug: string }> {
   const client = new ApolloClient({
-    uri: process.env.GRAPHCMS_PROJECT_API ?? "",
+    uri: process.env.GRAPHCMS_PROJECT_API && "",
     cache: new InMemoryCache(),
   });

[NoCoverage] StringLiteral
Projects/personal-website/lib/graphcms.ts:21:46
   slug: string,
 ): Promise<{ slug: string }> {
   const client = new ApolloClient({
-    uri: process.env.GRAPHCMS_PROJECT_API ?? "",
+    uri: process.env.GRAPHCMS_PROJECT_API ?? "Stryker was here!",
     cache: new InMemoryCache(),
   });

[NoCoverage] ObjectLiteral
Projects/personal-website/lib/graphcms.ts:25:12
     cache: new InMemoryCache(),
   });
   return client
-    .query({
-      query: GET_PREVIEW_POST_BY_SLUG,
-      variables: {
-        slug,
-        stage: "DRAFT",
-      },
-    })
+    .query({})
     .then((result) => {
       return result.data;

[NoCoverage] ObjectLiteral
Projects/personal-website/lib/graphcms.ts:27:18
   return client
     .query({
       query: GET_PREVIEW_POST_BY_SLUG,
-      variables: {
-        slug,
-        stage: "DRAFT",
-      },
+      variables: {},
     })
     .then((result) => {

[NoCoverage] BlockStatement
Projects/personal-website/lib/graphcms.ts:32:23
         stage: "DRAFT",
       },
     })
-    .then((result) => {
-      return result.data;
-    });
+    .then((result) => {});
 }
 

[NoCoverage] BlockStatement
Projects/personal-website/lib/graphcms.ts:45:77
   }
 `;
 
-export async function getAllPostsWithSlug(): Promise<AllPostsWithSlugQuery> {
-  const client = new ApolloClient({
-    uri: process.env.GRAPHCMS_PROJECT_API ?? "",
-    cache: new InMemoryCache(),
-  });
-  return client
-    .query({
-      query: ALL_POSTS_WITH_SLUG,
-    })
-    .then((result) => {
-      return result.data;
-    });
-}
+export async function getAllPostsWithSlug(): Promise<AllPostsWithSlugQuery> {}
 
 const POST_AND_MORE_POSTS = gql`

[NoCoverage] BlockStatement
Projects/personal-website/lib/graphcms.ts:99:35
 export async function getPostAndMorePosts(
   slug: string,
   preview: boolean,
-): Promise<PostAndMorePostsQuery> {
-  const client = new ApolloClient({
-    uri: process.env.GRAPHCMS_PROJECT_API ?? "",
-    cache: new InMemoryCache(),
-  });
-  return client
-    .query({
-      query: POST_AND_MORE_POSTS,
-      variables: {
-        stage: preview ? "DRAFT" : "PUBLISHED",
-        slug,
-      },
-    })
-
-    .then((result) => {
-      return result.data;
-    });
-}
+): Promise<PostAndMorePostsQuery> {}
 

[NoCoverage] BlockStatement
Projects/personal-website/lib/graphcms.ts:113:23
       },
     })
 
-    .then((result) => {
-      return result.data;
-    });
+    .then((result) => {});
 }
 
