[NoCoverage] ObjectLiteral
Projects/personal-website/lib/theme.ts:3:28
 import { createTheme } from "@material-ui/core/styles";
 
-export default createTheme({
-  components: {
-    MuiLink: { defaultProps: { underline: "none", color: "inherit" } },
-  },
-});
+export default createTheme({});
 
