[NoCoverage] BlockStatement
Projects/personal-website/pages/_app.tsx:19:17
   Component: React.ComponentType;
   pageProps: { children?: React.ReactNode };
   emotionCache: EmotionCache;
-}): JSX.Element {
-  return (
-    <CacheProvider value={emotionCache}>
-      <ThemeProvider theme={theme}>
-        <CssBaseline />
-        <Component {...pageProps} />
-      </ThemeProvider>
-    </CacheProvider>
-  );
-}
+}): JSX.Element {}
 
 export default MyApp;
