[NoCoverage] BlockStatement
Projects/personal-website/pages/_document.tsx:17:25
 import React from "react";
 
 export default class MyDocument extends Document {
-  render(): JSX.Element {
-    return (
-      <Html lang="en">
-        <Head>
-          {/* <meta httpEquiv="Content-Security-Policy" content={csp} /> */}
-          <meta name="theme-color" content={theme.palette.primary.main} />
-        </Head>
-        <body>
-          <Main />
-          <NextScript />
-        </body>
-      </Html>
-    );
-  }
+  render(): JSX.Element {}
 }
 

[NoCoverage] ArrowFunction
Projects/personal-website/pages/_document.tsx:47:20
   const cache = createEmotionCache();
   const { extractCriticalToChunks } = createEmotionServer(cache);
 
-  ctx.renderPage = () =>
-    originalRenderPage({
-      enhanceApp: (
-        App: NextComponentType<
-          AppContextType,
-          AppInitialProps & { emotionCache?: EmotionCache },
-          AppPropsType & { emotionCache?: EmotionCache }
-        >,
-      ) => {
-        const Component = (
-          props: AppPropsType & { emotionCache?: EmotionCache },
-        ) => <App emotionCache={cache} {...props} />;
-        return Component;
-      },
-    });
+  ctx.renderPage = () => undefined;
 
   const initialProps = await Document.getInitialProps(ctx);

[NoCoverage] ObjectLiteral
Projects/personal-website/pages/_document.tsx:48:24
   const { extractCriticalToChunks } = createEmotionServer(cache);
 
   ctx.renderPage = () =>
-    originalRenderPage({
-      enhanceApp: (
-        App: NextComponentType<
-          AppContextType,
-          AppInitialProps & { emotionCache?: EmotionCache },
-          AppPropsType & { emotionCache?: EmotionCache }
-        >,
-      ) => {
-        const Component = (
-          props: AppPropsType & { emotionCache?: EmotionCache },
-        ) => <App emotionCache={cache} {...props} />;
-        return Component;
-      },
-    });
+    originalRenderPage({});
 
   const initialProps = await Document.getInitialProps(ctx);

[NoCoverage] BlockStatement
Projects/personal-website/pages/_document.tsx:55:12
           AppInitialProps & { emotionCache?: EmotionCache },
           AppPropsType & { emotionCache?: EmotionCache }
         >,
-      ) => {
-        const Component = (
-          props: AppPropsType & { emotionCache?: EmotionCache },
-        ) => <App emotionCache={cache} {...props} />;
-        return Component;
-      },
+      ) => {},
     });
 

[NoCoverage] ArrowFunction
Projects/personal-website/pages/_document.tsx:56:27
           AppPropsType & { emotionCache?: EmotionCache }
         >,
       ) => {
-        const Component = (
-          props: AppPropsType & { emotionCache?: EmotionCache },
-        ) => <App emotionCache={cache} {...props} />;
+        const Component = () => undefined;
         return Component;
       },

[NoCoverage] ArrowFunction
Projects/personal-website/pages/_document.tsx:67:53
   // This is important. It prevents emotion to render invalid HTML.
   // See https://github.com/mui-org/material-ui/issues/26561#issuecomment-855286153
   const emotionStyles = extractCriticalToChunks(initialProps.html);
-  const emotionStyleTags = emotionStyles.styles.map((style) => (
-    <style
-      data-emotion={`${style.key} ${style.ids.join(" ")}`}
-      key={style.key}
-      // eslint-disable-next-line react/no-danger
-      dangerouslySetInnerHTML={{ __html: style.css }}
-    />
-  ));
+  const emotionStyleTags = emotionStyles.styles.map(() => undefined);
 
   return {

[NoCoverage] ObjectLiteral
Projects/personal-website/pages/_document.tsx:76:10
     />
   ));
 
-  return {
-    ...initialProps,
-    // Styles fragment is rendered after the app and page rendering finish.
-    styles: [
-      ...React.Children.toArray(initialProps.styles),
-      ...emotionStyleTags,
-    ],
-  };
+  return {};
 };
 
