[NoCoverage] BlockStatement
personal-website/pages/api/exit-preview.tsx:6:18
 export default async function handler(
   _: NextApiRequest,
   res: NextApiResponse,
-): Promise<void> {
-  // Exit the current user from "Preview Mode". This function accepts no args.
-  res.clearPreviewData();
-
-  // Redirect the user back to the index page.
-  res.writeHead(307, { Location: "/" });
-  res.end();
-}
+): Promise<void> {}
 

[NoCoverage] ObjectLiteral
personal-website/pages/api/exit-preview.tsx:11:22
   res.clearPreviewData();
 
   // Redirect the user back to the index page.
-  res.writeHead(307, { Location: "/" });
+  res.writeHead(307, {});
   res.end();
 }
