[NoCoverage] BooleanLiteral
Projects/personal-website/pages/index.tsx:32:24
   const morePosts = [...posts].slice(1);
   return (
     <>
-      <Layout preview={false}>
+      <Layout preview={true}>
         <Head>
           <title>Nigel Schuster&apos;s blog</title>

[NoCoverage] ConditionalExpression
Projects/personal-website/pages/index.tsx:38:12
         </Head>
         <Container>
           <Intro />
-          {heroPost && (
-            <HeroPost
-              title={heroPost.title}
-              coverImage={heroPost.coverImage}
-              author={heroPost.author}
-              slug={heroPost.slug}
-              excerpt={heroPost.excerpt}
-            />
-          )}
+          {true}
           <MoreStories moreStories={morePosts} />
         </Container>

[NoCoverage] ConditionalExpression
Projects/personal-website/pages/index.tsx:38:12
         </Head>
         <Container>
           <Intro />
-          {heroPost && (
-            <HeroPost
-              title={heroPost.title}
-              coverImage={heroPost.coverImage}
-              author={heroPost.author}
-              slug={heroPost.slug}
-              excerpt={heroPost.excerpt}
-            />
-          )}
+          {false}
           <MoreStories moreStories={morePosts} />
         </Container>

[NoCoverage] BlockStatement
Projects/personal-website/pages/index.tsx:54:59
   );
 }
 
-export const getStaticProps: GetStaticProps = async () => {
-  const client = new ApolloClient({
-    uri: process.env.GRAPHCMS_PROJECT_API ?? "",
-    cache: new InMemoryCache(),
-  });
-  const posts = await client
-    .query({
-      query: INDEX_LOOKUP,
-    })
-    .then((result) => {
-      return result.data;
-    });
-  return {
-    props: posts,
-  };
-};
+export const getStaticProps: GetStaticProps = async () => {};
 

[NoCoverage] ObjectLiteral
Projects/personal-website/pages/index.tsx:60:12
     cache: new InMemoryCache(),
   });
   const posts = await client
-    .query({
-      query: INDEX_LOOKUP,
-    })
+    .query({})
     .then((result) => {
       return result.data;
