[NoCoverage] StringLiteral
personal-website/pages/posts/[slug].tsx:69:31
     }
   }
 `;
-export const POST_LOOKUP = gql`
-  ${MORE_STORIES}
-  fragment PostLookup on Query {
-    post(stage: $stage, where: { slug: $slug }) {
-      ...Post
-    }
-    ...MoreStories
-  }
-`;
+export const POST_LOOKUP = gql``;
 
 export default function Post(lookup: PostLookupFragment): JSX.Element {

[NoCoverage] ConditionalExpression
personal-website/pages/posts/[slug].tsx:83:7
   const router = useRouter();
   const { post } = lookup;
 
-  if (!router.isFallback && !post?.slug) {
+  if (true) {
     return <ErrorPage statusCode={404} />;
   }

[NoCoverage] BlockStatement
personal-website/pages/posts/[slug].tsx:83:42
   const router = useRouter();
   const { post } = lookup;
 
-  if (!router.isFallback && !post?.slug) {
-    return <ErrorPage statusCode={404} />;
-  }
+  if (!router.isFallback && !post?.slug) {}
 
   return (

[NoCoverage] BooleanLiteral
personal-website/pages/posts/[slug].tsx:88:22
   }
 
   return (
-    <Layout preview={false}>
+    <Layout preview={true}>
       <Container>
         <Header />

[NoCoverage] LogicalOperator
personal-website/pages/posts/[slug].tsx:99:53
               <>
                 <Head>
                   <title>{post.title}</title>
-                  <meta name="description" content={post.excerpt ?? ""} />
+                  <meta name="description" content={post.excerpt && ""} />
                   <meta property="og:title" content={post.title} />
                   <meta

[NoCoverage] LogicalOperator
personal-website/pages/posts/[slug].tsx:103:30
                   <meta property="og:title" content={post.title} />
                   <meta
                     property="og:description"
-                    content={post.excerpt ?? ""}
+                    content={post.excerpt && ""}
                   />
                   <meta property="og:type" content="article" />

[NoCoverage] OptionalChaining
personal-website/pages/posts/[slug].tsx:109:51
                   <meta property="og:locale" content="en_US" />
                 </Head>
                 <Card>
-                  <CardMedia component="img" src={post.coverImage?.url} />
+                  <CardMedia component="img" src={post.coverImage.url} />
                   <CardContent>
                     <Box display="flex">

[NoCoverage] OptionalChaining
personal-website/pages/posts/[slug].tsx:121:36
                         <Chip
                           avatar={
                             <Avatar
-                              alt={post.author?.name}
+                              alt={post.author.name}
                               src={post.author?.picture?.url}
                             />

[NoCoverage] OptionalChaining
personal-website/pages/posts/[slug].tsx:122:36
                           avatar={
                             <Avatar
                               alt={post.author?.name}
-                              src={post.author?.picture?.url}
+                              src={post.author.picture?.url}
                             />
                           }

[NoCoverage] OptionalChaining
personal-website/pages/posts/[slug].tsx:122:36
                           avatar={
                             <Avatar
                               alt={post.author?.name}
-                              src={post.author?.picture?.url}
+                              src={post.author?.picture.url}
                             />
                           }

[NoCoverage] OptionalChaining
personal-website/pages/posts/[slug].tsx:125:34
                               src={post.author?.picture?.url}
                             />
                           }
-                          label={post.author?.name}
+                          label={post.author.name}
                         />
                       </Box>

[NoCoverage] BooleanLiteral
personal-website/pages/posts/[slug].tsx:136:52
                     >
                       {post.content}
                     </ReactMarkdown>
-                    <div suppressHydrationWarning={true}>
+                    <div suppressHydrationWarning={false}>
                       {process.browser && (
                         <div>

[NoCoverage] LogicalOperator
personal-website/pages/posts/[slug].tsx:137:24
                       {post.content}
                     </ReactMarkdown>
                     <div suppressHydrationWarning={true}>
-                      {process.browser && (
-                        <div>
-                          <EmailShareButton url={window.location.href}>
-                            <EmailIcon round />
-                          </EmailShareButton>
-                          <LinkedinShareButton url={window.location.href}>
-                            <LinkedinIcon round />
-                          </LinkedinShareButton>
-                          <RedditShareButton url={window.location.href}>
-                            <RedditIcon round />
-                          </RedditShareButton>
-                        </div>
-                      )}
+                      {process.browser || <div>
+                          <EmailShareButton url={window.location.href}>
+                            <EmailIcon round />
+                          </EmailShareButton>
+                          <LinkedinShareButton url={window.location.href}>
+                            <LinkedinIcon round />
+                          </LinkedinShareButton>
+                          <RedditShareButton url={window.location.href}>
+                            <RedditIcon round />
+                          </RedditShareButton>
+                        </div>}
                     </div>
                   </CardContent>

[NoCoverage] ConditionalExpression
personal-website/pages/posts/[slug].tsx:137:24
                       {post.content}
                     </ReactMarkdown>
                     <div suppressHydrationWarning={true}>
-                      {process.browser && (
-                        <div>
-                          <EmailShareButton url={window.location.href}>
-                            <EmailIcon round />
-                          </EmailShareButton>
-                          <LinkedinShareButton url={window.location.href}>
-                            <LinkedinIcon round />
-                          </LinkedinShareButton>
-                          <RedditShareButton url={window.location.href}>
-                            <RedditIcon round />
-                          </RedditShareButton>
-                        </div>
-                      )}
+                      {true}
                     </div>
                   </CardContent>

[NoCoverage] BooleanLiteral
personal-website/pages/posts/[slug].tsx:168:13
 
 export const getStaticProps: GetStaticProps = async ({
   params,
-  preview = false,
+  preview = true,
 }: {
   params?: { slug?: string };

[NoCoverage] BlockStatement
personal-website/pages/posts/[slug].tsx:172:7
 }: {
   params?: { slug?: string };
   preview?: boolean;
-}) => {
-  const data = await getPostAndMorePosts(params?.slug ?? "", preview);
-  return {
-    props: data,
-  };
-};
+}) => {};
 
 export const getStaticPaths: GetStaticPaths = async () => {

[NoCoverage] LogicalOperator
personal-website/pages/posts/[slug].tsx:173:42
   params?: { slug?: string };
   preview?: boolean;
 }) => {
-  const data = await getPostAndMorePosts(params?.slug ?? "", preview);
+  const data = await getPostAndMorePosts(params?.slug && "", preview);
   return {
     props: data,

[NoCoverage] OptionalChaining
personal-website/pages/posts/[slug].tsx:173:42
   params?: { slug?: string };
   preview?: boolean;
 }) => {
-  const data = await getPostAndMorePosts(params?.slug ?? "", preview);
+  const data = await getPostAndMorePosts(params.slug ?? "", preview);
   return {
     props: data,

[NoCoverage] BlockStatement
personal-website/pages/posts/[slug].tsx:179:59
   };
 };
 
-export const getStaticPaths: GetStaticPaths = async () => {
-  const { posts } = await getAllPostsWithSlug();
-  return {
-    paths: posts.map((input) => {
-      const slug = input?.slug ?? "";
-      return {
-        params: { slug },
-      };
-    }),
-    // fallback: true,
-    fallback: false,
-  };
-};
+export const getStaticPaths: GetStaticPaths = async () => {};
 

[NoCoverage] ObjectLiteral
personal-website/pages/posts/[slug].tsx:181:10
 
 export const getStaticPaths: GetStaticPaths = async () => {
   const { posts } = await getAllPostsWithSlug();
-  return {
-    paths: posts.map((input) => {
-      const slug = input?.slug ?? "";
-      return {
-        params: { slug },
-      };
-    }),
-    // fallback: true,
-    fallback: false,
-  };
+  return {};
 };
 

[NoCoverage] BlockStatement
personal-website/pages/posts/[slug].tsx:182:33
 export const getStaticPaths: GetStaticPaths = async () => {
   const { posts } = await getAllPostsWithSlug();
   return {
-    paths: posts.map((input) => {
-      const slug = input?.slug ?? "";
-      return {
-        params: { slug },
-      };
-    }),
+    paths: posts.map((input) => {}),
     // fallback: true,
     fallback: false,

[NoCoverage] LogicalOperator
personal-website/pages/posts/[slug].tsx:183:20
   const { posts } = await getAllPostsWithSlug();
   return {
     paths: posts.map((input) => {
-      const slug = input?.slug ?? "";
+      const slug = input?.slug && "";
       return {
         params: { slug },

[NoCoverage] OptionalChaining
personal-website/pages/posts/[slug].tsx:183:20
   const { posts } = await getAllPostsWithSlug();
   return {
     paths: posts.map((input) => {
-      const slug = input?.slug ?? "";
+      const slug = input.slug ?? "";
       return {
         params: { slug },

[NoCoverage] ObjectLiteral
personal-website/pages/posts/[slug].tsx:184:14
   return {
     paths: posts.map((input) => {
       const slug = input?.slug ?? "";
-      return {
-        params: { slug },
-      };
+      return {};
     }),
     // fallback: true,

[NoCoverage] BooleanLiteral
personal-website/pages/posts/[slug].tsx:189:15
       };
     }),
     // fallback: true,
-    fallback: false,
+    fallback: true,
   };
 };
