[Killed] BlockStatement
Projects/personal-website/components/date.tsx:7:17
   dateString,
 }: {
   dateString: string;
-}): JSX.Element {
-  const date = parseISO(dateString);
-  return <time dateTime={dateString}>{format(date, "LLLL	d, yyyy")}</time>;
-}
+}): JSX.Element {}
 
killedBy: date renders a heading
statusReason: Error: Date(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
